IDENTIFICATION DIVISION.
PROGRAM-ID. BUDARKASSI2.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 INP PIC X(50).
        88 EOF VALUE SPACES.
    01 A PIC 9(6).
    01 B PIC 9(6).
    01 ANS PIC Z(11).

PROCEDURE DIVISION.
    ACCEPT INP
    
    UNSTRING INP
        DELIMITED BY SPACE
        INTO A, B
    MULTIPLY A BY B GIVING ANS
    DISPLAY ANS
    STOP RUN.
