IDENTIFICATION DIVISION.
PROGRAM-ID. ELDSPYTUR.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 N   PIC S9(30).
  01 M   PIC S9(30).
  01 K   PIC S9(30).
  01 INP PIC X(100).
  01 OUT PIC X(100).

PROCEDURE DIVISION.
  PERFORM
    ACCEPT INP
    UNSTRING INP
      DELIMITED BY SPACE
      INTO K, N
      COMPUTE M = function MOD(K, N + 1)
    IF M = 0
      DISPLAY "Neibb"
    ELSE
      DISPLAY "Jebb"
  END-PERFORM.
