IDENTIFICATION DIVISION.
PROGRAM-ID. BERGMAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 INP PIC X(1000).
PROCEDURE DIVISION.
    PERFORM 20 TIMES
       DISPLAY "Hipp hipp hurra!"
    END-PERFORM.
