IDENTIFICATION DIVISION.
PROGRAM-ID. LIDASKIPTING.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 INP PIC S9(50).
    01 OUT PIC S9(50).

PROCEDURE DIVISION.
    ACCEPT INP.
    
    
    
    