IDENTIFICATION DIVISION.
PROGRAM-ID. LIDASKIPTING.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 INP  PIC X(101).
    01 MODU PIC S9(1).

PROCEDURE DIVISION.
    PERFORM
       ACCEPT INP
       SET MODU TO function MOD(INP, 3)
       IF MODU = 0 THEN
           DISPLAY "Jebb"
       ELSE
           DISPLAY "Neibb"
       END-IF
    END-PERFORM.
