IDENTIFICATION DIVISION.
PROGRAM-ID. SAMHVERFUR.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 N PIC S9(4).

PROCEDURE DIVISION.
    PERFORM
       DISPLAY "1 2"
       DISPLAY "2 4"
       DISPLAY "3 8"
       DISPLAY "4 11"
       DISPLAY "5 22"
       DISPLAY "6 55"
       DISPLAY "7 121"
       DISPLAY "8 252"
       DISPLAY "9 505"
       DISPLAY "10 1001"
       DISPLAY "11 2002"
       DISPLAY "12 4004"
       DISPLAY "13 8118"
       DISPLAY "14 16361"
       DISPLAY "15 32723"
       DISPLAY "16 65456"
       DISPLAY "17 130031"
       DISPLAY "18 261162"
       DISPLAY "19 523325"
       DISPLAY "20 1048401"
       DISPLAY "21 2096902"
       DISPLAY "22 4193914"
       DISPLAY "23 8387838"
       DISPLAY "24 16766761"
       DISPLAY "25 33544533"
       DISPLAY "26 67100176"
       DISPLAY "27 134212431"
       DISPLAY "28 268434862"
       DISPLAY "29 536868635"
       DISPLAY "30 1073663701"
       DISPLAY "31 2147447412"
       DISPLAY "32 4294884924"
       DISPLAY "33 8589889858"
       DISPLAY "34 17179797171"
       DISPLAY "35 34359695343"
       DISPLAY "36 68719391786"
       DISPLAY "37 137438834731"
       DISPLAY "38 274877778472"
       DISPLAY "39 549755557945"
       DISPLAY "40 1099511159901"
       DISPLAY "41 2199023209912"
       DISPLAY "42 4398046408934"
       DISPLAY "43 8796092906978"
       DISPLAY "44 17592177129571"
       DISPLAY "45 35184366348153"
       DISPLAY "46 70368733786307"
       DISPLAY "47 140737484737041"
       DISPLAY "48 281474969474182"
       DISPLAY "49 562949949949265"
       DISPLAY "50 1125899889985211"
       DISPLAY "51 2251799779971522"
       DISPLAY "52 4503599559953054"
       DISPLAY "53 9007199229917009"
       DISPLAY "54 18014398489341081"
       DISPLAY "55 36028796969782063"
       DISPLAY "56 72057593939575027"
       DISPLAY "57 144115187781511441"
       DISPLAY "58 288230375573032882"
       DISPLAY "59 576460752257064675"
       DISPLAY "60 1152921504051292511"
       DISPLAY "61 2305843009003485032"
       DISPLAY "62 4611686018106861164"
       DISPLAY "63 9223372036302733229"
       DISPLAY "64 18446744066044764481"
       DISPLAY "65 36893488144188439863"
       DISPLAY "66 73786976288267968737"
       DISPLAY "67 147573952585259375741"
       DISPLAY "68 295147905171509741592"
       DISPLAY "69 590295810353018592095"
       DISPLAY "70 1180591620660261950811"
       DISPLAY "71 2361183241331423811632"
       DISPLAY "72 4722366482772846632274"
       DISPLAY "73 9444732965665692374449"
       DISPLAY "74 18889465931413956498881"
       DISPLAY "75 37778931862926813987773"
       DISPLAY "76 75557863725852736875557"
       DISPLAY "77 151115727451154727511151"
       DISPLAY "78 302231454903309454132203"
       DISPLAY "79 604462909806608909264406"
       DISPLAY "80 1208925819614169185298021"
       DISPLAY "81 2417851639229229361587142"
       DISPLAY "82 4835703278457548723075384"
       DISPLAY "83 9671406556916196556041769"
       DISPLAY "84 19342813113833831131824391"
       DISPLAY "85 38685626227666672262658683"
       DISPLAY "86 77371252455333355425217377"
       DISPLAY "87 154742504910666019405247451"
       DISPLAY "88 309485009821343128900584903"
       DISPLAY "89 618970019642686246910079816"
       DISPLAY "90 1237940039285335829300497321"
       DISPLAY "91 2475880078570660758700885742"
       DISPLAY "92 4951760157141441417510671594"
       DISPLAY "93 9903520314283003824130253099"
       DISPLAY "94 19807040628566066582604070891"
       DISPLAY "95 39614081257132123175218041693"
       DISPLAY "96 79228162514264246241526182297"
       DISPLAY "97 158456325028527725820523654851"
       DISPLAY "98 316912650057056650750056219613"
       DISPLAY "99 633825300114114411411003528336"
       DISPLAY "100 1267650600228229228220060567621"
    END-PERFORM.
