IDENTIFICATION DIVISION.
PROGRAM-ID. BERGMAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 N   PIC S9(30).
    01 M   PIC s9(30).
PROCEDURE DIVISION.
  PERFORM
    ACCEPT N
    COMPUTE M = function MOD(n, 10)
    IF M = 0
      DISPLAY "Jebb"
    ELSE
      DISPLAY "Neibb"
  END-PERFORM.
 
