IDENTIFICATION DIVISION.
PROGRAM-ID. TAKKAR.

DATA DIVISION.
WORKING-STORAGE SECTION.
   01 N   PIC S9(30).
   01 M   PIC S9(30).
   01 K   PIC S9(30).
   01 INP PIC X(100).
   01 OUT PIC X(100).

PROCEDURE DIVISION.
   PERFORM
      ACCEPT N
      ACCEPT M
      IF N=M
         DISPLAY "WORLD WAR 3!"
      ELSE IF N<M
         DISPLAY "FAKE NEWS!"
      ELSE
         DISPLAY "MAGA!"
      END-IF
   END-PERFORM.
