IDENTIFICATION DIVISION.
PROGRAM-ID. BERGMAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 N   PIC S9(30).
    01 INP PIC X(1000).
    01 BEG PIC X(1000) VALUE "Takk ".
PROCEDURE DIVISION.
    ACCEPT N
    PERFORM N TIMES
       ACCEPT INP
       DISPLAY FUNCTION CONCATENATE(
        FUNCTION TRIM(BEG); SPACE;
        FUNCTION TRIM(INP); 
       )
    END-PERFORM.
