IDENTIFICATION DIVISION.
PROGRAM-ID. test.

DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 W PIC X(5).
       01 S PIC 9(5).       

PROCEDURE DIVISION.
       ACCEPT W
       ACCEPT S
       DISPLAY W S
STOP RUN.
