IDENTIFICATION DIVISION.
PROGRAM-ID. BERGMAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 INP PIC X(1000).
PROCEDURE DIVISION.
    PERFORM 
       DISPLAY "TIL HAMINGJU MED AFMAELID FORRITUNARKEPPNI FRAMHALDSSKOLANNA!"
    END-PERFORM.
