IDENTIFICATION DIVISION.
PROGRAM-ID. CARROTS.

DATA DIVISION.
WORKING-STORAGE SECTION.
   01 N   PIC S9(30).
   01 M   PIC S9(30).
   01 K   PIC S9(30).
   01 INP PIC X(100).
   01 OUT PIC X(100).

PROCEDURE DIVISION.
   PERFORM
      ACCEPT INP
      UNSTRING INP
          DELIMITED BY SPACE
          INTO N, OUT
      DISPLAY OUT
      
   END-PERFORM.
