IDENTIFICATION DIVISION.
PROGRAM-ID. TWOSTONES.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 N   PIC S9(30).
    01 K   PIC S9(30).

PROCEDURE DIVISION.
    PERFORM
       ACCEPT N

        IF function MOD(N, 2) = 0 THEN
           DISPLAY "Bob"
        ELSE
           DISPLAY "Alice"
    END-PERFORM.
